RIOT-OS/RIOT/cpu/efm32/families/efm32gg12b/include/vendor/efm32gg12b_qspi.h
  uint32_t       RESERVED7[1U];              /**< Reserved for future use **/
  __IOM uint32_t ROUTEPEN;                   /**< I/O Routing Pin Enable Register  */
  __IOM uint32_t ROUTELOC0;                  /**< I/O Route Location Register 0  */
} QSPI_TypeDef;                              /** @} */

/***************************************************************************//**
 * @addtogroup EFM32GG12B_QSPI
 * @{
 * @defgroup EFM32GG12B_QSPI_BitFields  QSPI Bit Fields
 * @{
 ******************************************************************************/

/* Bit fields for QSPI CONFIG */
#define _QSPI_CONFIG_RESETVALUE                                   0x80780081UL                                   /**< Default value for QSPI_CONFIG */
#define _QSPI_CONFIG_MASK                                         0xE3FF4FFFUL                                   /**< Mask for QSPI_CONFIG */
#define QSPI_CONFIG_ENBSPI                                        (0x1UL << 0)                                   /**< QSPI Enable */
#define _QSPI_CONFIG_ENBSPI_SHIFT                                 0                                              /**< Shift value for QSPI_ENBSPI */
#define _QSPI_CONFIG_ENBSPI_MASK                                  0x1UL                                          /**< Bit mask for QSPI_ENBSPI */
#define _QSPI_CONFIG_ENBSPI_DEFAULT                               0x00000001UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBSPI_DEFAULT                                (_QSPI_CONFIG_ENBSPI_DEFAULT << 0)             /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_SELCLKPOL                                     (0x1UL << 1)                                   /**< Clock Polarity, CPOL */
#define _QSPI_CONFIG_SELCLKPOL_SHIFT                              1                                              /**< Shift value for QSPI_SELCLKPOL */
#define _QSPI_CONFIG_SELCLKPOL_MASK                               0x2UL                                          /**< Bit mask for QSPI_SELCLKPOL */
#define _QSPI_CONFIG_SELCLKPOL_DEFAULT                            0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_SELCLKPOL_DEFAULT                             (_QSPI_CONFIG_SELCLKPOL_DEFAULT << 1)          /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_SELCLKPHASE                                   (0x1UL << 2)                                   /**< Clock Phase, CPHA */
#define _QSPI_CONFIG_SELCLKPHASE_SHIFT                            2                                              /**< Shift value for QSPI_SELCLKPHASE */
#define _QSPI_CONFIG_SELCLKPHASE_MASK                             0x4UL                                          /**< Bit mask for QSPI_SELCLKPHASE */
#define _QSPI_CONFIG_SELCLKPHASE_DEFAULT                          0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_SELCLKPHASE_DEFAULT                           (_QSPI_CONFIG_SELCLKPHASE_DEFAULT << 2)        /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_PHYMODEENABLE                                 (0x1UL << 3)                                   /**< PHY Mode Enable */
#define _QSPI_CONFIG_PHYMODEENABLE_SHIFT                          3                                              /**< Shift value for QSPI_PHYMODEENABLE */
#define _QSPI_CONFIG_PHYMODEENABLE_MASK                           0x8UL                                          /**< Bit mask for QSPI_PHYMODEENABLE */
#define _QSPI_CONFIG_PHYMODEENABLE_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_PHYMODEENABLE_DEFAULT                         (_QSPI_CONFIG_PHYMODEENABLE_DEFAULT << 3)      /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBDEVHOLD                                    (0x1UL << 4)                                   /**< Enable Device Hold  */
#define _QSPI_CONFIG_ENBDEVHOLD_SHIFT                             4                                              /**< Shift value for QSPI_ENBDEVHOLD */
#define _QSPI_CONFIG_ENBDEVHOLD_MASK                              0x10UL                                         /**< Bit mask for QSPI_ENBDEVHOLD */
#define _QSPI_CONFIG_ENBDEVHOLD_DEFAULT                           0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBDEVHOLD_DEFAULT                            (_QSPI_CONFIG_ENBDEVHOLD_DEFAULT << 4)         /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBDEVRST                                     (0x1UL << 5)                                   /**< Enable Device Reset  */
#define _QSPI_CONFIG_ENBDEVRST_SHIFT                              5                                              /**< Shift value for QSPI_ENBDEVRST */
#define _QSPI_CONFIG_ENBDEVRST_MASK                               0x20UL                                         /**< Bit mask for QSPI_ENBDEVRST */
#define _QSPI_CONFIG_ENBDEVRST_DEFAULT                            0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBDEVRST_DEFAULT                             (_QSPI_CONFIG_ENBDEVRST_DEFAULT << 5)          /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_DEVRSTCONFIG                                  (0x1UL << 6)                                   /**< Device Reset Configuration */
#define _QSPI_CONFIG_DEVRSTCONFIG_SHIFT                           6                                              /**< Shift value for QSPI_DEVRSTCONFIG */
#define _QSPI_CONFIG_DEVRSTCONFIG_MASK                            0x40UL                                         /**< Bit mask for QSPI_DEVRSTCONFIG */
#define _QSPI_CONFIG_DEVRSTCONFIG_DEFAULT                         0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_DEVRSTCONFIG_DEFAULT                          (_QSPI_CONFIG_DEVRSTCONFIG_DEFAULT << 6)       /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBDIRACCCTLR                                 (0x1UL << 7)                                   /**< Enable Direct Access Controller */
#define _QSPI_CONFIG_ENBDIRACCCTLR_SHIFT                          7                                              /**< Shift value for QSPI_ENBDIRACCCTLR */
#define _QSPI_CONFIG_ENBDIRACCCTLR_MASK                           0x80UL                                         /**< Bit mask for QSPI_ENBDIRACCCTLR */
#define _QSPI_CONFIG_ENBDIRACCCTLR_DEFAULT                        0x00000001UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBDIRACCCTLR_DEFAULT                         (_QSPI_CONFIG_ENBDIRACCCTLR_DEFAULT << 7)      /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBLEGACYIPMODE                               (0x1UL << 8)                                   /**< Legacy IP Mode Enable */
#define _QSPI_CONFIG_ENBLEGACYIPMODE_SHIFT                        8                                              /**< Shift value for QSPI_ENBLEGACYIPMODE */
#define _QSPI_CONFIG_ENBLEGACYIPMODE_MASK                         0x100UL                                        /**< Bit mask for QSPI_ENBLEGACYIPMODE */
#define _QSPI_CONFIG_ENBLEGACYIPMODE_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBLEGACYIPMODE_DEFAULT                       (_QSPI_CONFIG_ENBLEGACYIPMODE_DEFAULT << 8)    /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_PERIPHSELDEC                                  (0x1UL << 9)                                   /**< Peripheral Select Decode */
#define _QSPI_CONFIG_PERIPHSELDEC_SHIFT                           9                                              /**< Shift value for QSPI_PERIPHSELDEC */
#define _QSPI_CONFIG_PERIPHSELDEC_MASK                            0x200UL                                        /**< Bit mask for QSPI_PERIPHSELDEC */
#define _QSPI_CONFIG_PERIPHSELDEC_DEFAULT                         0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_PERIPHSELDEC_DEFAULT                          (_QSPI_CONFIG_PERIPHSELDEC_DEFAULT << 9)       /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define _QSPI_CONFIG_PERIPHCSLINES_SHIFT                          10                                             /**< Shift value for QSPI_PERIPHCSLINES */
#define _QSPI_CONFIG_PERIPHCSLINES_MASK                           0xC00UL                                        /**< Bit mask for QSPI_PERIPHCSLINES */
#define _QSPI_CONFIG_PERIPHCSLINES_DEFAULT                        0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_PERIPHCSLINES_DEFAULT                         (_QSPI_CONFIG_PERIPHCSLINES_DEFAULT << 10)     /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_WRPROTFLASH                                   (0x1UL << 14)                                  /**< Write Protect Flash Pin */
#define _QSPI_CONFIG_WRPROTFLASH_SHIFT                            14                                             /**< Shift value for QSPI_WRPROTFLASH */
#define _QSPI_CONFIG_WRPROTFLASH_MASK                             0x4000UL                                       /**< Bit mask for QSPI_WRPROTFLASH */
#define _QSPI_CONFIG_WRPROTFLASH_DEFAULT                          0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_WRPROTFLASH_DEFAULT                           (_QSPI_CONFIG_WRPROTFLASH_DEFAULT << 14)       /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBAHBADDRREMAP                               (0x1UL << 16)                                  /**< Enable Address Remapping */
#define _QSPI_CONFIG_ENBAHBADDRREMAP_SHIFT                        16                                             /**< Shift value for QSPI_ENBAHBADDRREMAP */
#define _QSPI_CONFIG_ENBAHBADDRREMAP_MASK                         0x10000UL                                      /**< Bit mask for QSPI_ENBAHBADDRREMAP */
#define _QSPI_CONFIG_ENBAHBADDRREMAP_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENBAHBADDRREMAP_DEFAULT                       (_QSPI_CONFIG_ENBAHBADDRREMAP_DEFAULT << 16)   /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENTERXIPMODE                                  (0x1UL << 17)                                  /**< Enter XIP Mode on Next READ */
#define _QSPI_CONFIG_ENTERXIPMODE_SHIFT                           17                                             /**< Shift value for QSPI_ENTERXIPMODE */
#define _QSPI_CONFIG_ENTERXIPMODE_MASK                            0x20000UL                                      /**< Bit mask for QSPI_ENTERXIPMODE */
#define _QSPI_CONFIG_ENTERXIPMODE_DEFAULT                         0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENTERXIPMODE_DEFAULT                          (_QSPI_CONFIG_ENTERXIPMODE_DEFAULT << 17)      /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENTERXIPMODEIMM                               (0x1UL << 18)                                  /**< Enter XIP Mode Immediately */
#define _QSPI_CONFIG_ENTERXIPMODEIMM_SHIFT                        18                                             /**< Shift value for QSPI_ENTERXIPMODEIMM */
#define _QSPI_CONFIG_ENTERXIPMODEIMM_MASK                         0x40000UL                                      /**< Bit mask for QSPI_ENTERXIPMODEIMM */
#define _QSPI_CONFIG_ENTERXIPMODEIMM_DEFAULT                      0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENTERXIPMODEIMM_DEFAULT                       (_QSPI_CONFIG_ENTERXIPMODEIMM_DEFAULT << 18)   /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define _QSPI_CONFIG_MSTRBAUDDIV_SHIFT                            19                                             /**< Shift value for QSPI_MSTRBAUDDIV */
#define _QSPI_CONFIG_MSTRBAUDDIV_MASK                             0x780000UL                                     /**< Bit mask for QSPI_MSTRBAUDDIV */
#define _QSPI_CONFIG_MSTRBAUDDIV_DEFAULT                          0x0000000FUL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_MSTRBAUDDIV_DEFAULT                           (_QSPI_CONFIG_MSTRBAUDDIV_DEFAULT << 19)       /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENABLEAHBDECODER                              (0x1UL << 23)                                  /**< Enable Address Decoder */
#define _QSPI_CONFIG_ENABLEAHBDECODER_SHIFT                       23                                             /**< Shift value for QSPI_ENABLEAHBDECODER */
#define _QSPI_CONFIG_ENABLEAHBDECODER_MASK                        0x800000UL                                     /**< Bit mask for QSPI_ENABLEAHBDECODER */
#define _QSPI_CONFIG_ENABLEAHBDECODER_DEFAULT                     0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENABLEAHBDECODER_DEFAULT                      (_QSPI_CONFIG_ENABLEAHBDECODER_DEFAULT << 23)  /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENABLEDTRPROTOCOL                             (0x1UL << 24)                                  /**< Enable DTR Protocol */
#define _QSPI_CONFIG_ENABLEDTRPROTOCOL_SHIFT                      24                                             /**< Shift value for QSPI_ENABLEDTRPROTOCOL */
#define _QSPI_CONFIG_ENABLEDTRPROTOCOL_MASK                       0x1000000UL                                    /**< Bit mask for QSPI_ENABLEDTRPROTOCOL */
#define _QSPI_CONFIG_ENABLEDTRPROTOCOL_DEFAULT                    0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_ENABLEDTRPROTOCOL_DEFAULT                     (_QSPI_CONFIG_ENABLEDTRPROTOCOL_DEFAULT << 24) /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_PIPELINEPHY                                   (0x1UL << 25)                                  /**< Pipeline PHY Mode Enable */
#define _QSPI_CONFIG_PIPELINEPHY_SHIFT                            25                                             /**< Shift value for QSPI_PIPELINEPHY */
#define _QSPI_CONFIG_PIPELINEPHY_MASK                             0x2000000UL                                    /**< Bit mask for QSPI_PIPELINEPHY */
#define _QSPI_CONFIG_PIPELINEPHY_DEFAULT                          0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_PIPELINEPHY_DEFAULT                           (_QSPI_CONFIG_PIPELINEPHY_DEFAULT << 25)       /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_CRCENABLE                                     (0x1UL << 29)                                  /**< CRC Enable Bit */
#define _QSPI_CONFIG_CRCENABLE_SHIFT                              29                                             /**< Shift value for QSPI_CRCENABLE */
#define _QSPI_CONFIG_CRCENABLE_MASK                               0x20000000UL                                   /**< Bit mask for QSPI_CRCENABLE */
#define _QSPI_CONFIG_CRCENABLE_DEFAULT                            0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_CRCENABLE_DEFAULT                             (_QSPI_CONFIG_CRCENABLE_DEFAULT << 29)         /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_DUALBYTEOPCODEEN                              (0x1UL << 30)                                  /**< Dual-byte Opcode Mode Enable Bit */
#define _QSPI_CONFIG_DUALBYTEOPCODEEN_SHIFT                       30                                             /**< Shift value for QSPI_DUALBYTEOPCODEEN */
#define _QSPI_CONFIG_DUALBYTEOPCODEEN_MASK                        0x40000000UL                                   /**< Bit mask for QSPI_DUALBYTEOPCODEEN */
#define _QSPI_CONFIG_DUALBYTEOPCODEEN_DEFAULT                     0x00000000UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_DUALBYTEOPCODEEN_DEFAULT                      (_QSPI_CONFIG_DUALBYTEOPCODEEN_DEFAULT << 30)  /**< Shifted mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_IDLE                                          (0x1UL << 31)                                  /**< Serial Interface and Low Level SPI Pipeline is IDLE */
#define _QSPI_CONFIG_IDLE_SHIFT                                   31                                             /**< Shift value for QSPI_IDLE */
#define _QSPI_CONFIG_IDLE_MASK                                    0x80000000UL                                   /**< Bit mask for QSPI_IDLE */
#define _QSPI_CONFIG_IDLE_DEFAULT                                 0x00000001UL                                   /**< Mode DEFAULT for QSPI_CONFIG */
#define QSPI_CONFIG_IDLE_DEFAULT                                  (_QSPI_CONFIG_IDLE_DEFAULT << 31)              /**< Shifted mode DEFAULT for QSPI_CONFIG */

/* Bit fields for QSPI DEVINSTRRDCONFIG */
#define _QSPI_DEVINSTRRDCONFIG_RESETVALUE                         0x00000003UL                                               /**< Default value for QSPI_DEVINSTRRDCONFIG */
#define _QSPI_DEVINSTRRDCONFIG_MASK                               0x1F1337FFUL                                               /**< Mask for QSPI_DEVINSTRRDCONFIG */
#define _QSPI_DEVINSTRRDCONFIG_RDOPCODENONXIP_SHIFT               0                                                          /**< Shift value for QSPI_RDOPCODENONXIP */
#define _QSPI_DEVINSTRRDCONFIG_RDOPCODENONXIP_MASK                0xFFUL                                                     /**< Bit mask for QSPI_RDOPCODENONXIP */
#define _QSPI_DEVINSTRRDCONFIG_RDOPCODENONXIP_DEFAULT             0x00000003UL                                               /**< Mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_RDOPCODENONXIP_DEFAULT              (_QSPI_DEVINSTRRDCONFIG_RDOPCODENONXIP_DEFAULT << 0)       /**< Shifted mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define _QSPI_DEVINSTRRDCONFIG_INSTRTYPE_SHIFT                    8                                                          /**< Shift value for QSPI_INSTRTYPE */
#define _QSPI_DEVINSTRRDCONFIG_INSTRTYPE_MASK                     0x300UL                                                    /**< Bit mask for QSPI_INSTRTYPE */
#define _QSPI_DEVINSTRRDCONFIG_INSTRTYPE_DEFAULT                  0x00000000UL                                               /**< Mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_INSTRTYPE_DEFAULT                   (_QSPI_DEVINSTRRDCONFIG_INSTRTYPE_DEFAULT << 8)            /**< Shifted mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_DDREN                               (0x1UL << 10)                                              /**< DDR Enable */
#define _QSPI_DEVINSTRRDCONFIG_DDREN_SHIFT                        10                                                         /**< Shift value for QSPI_DDREN */
#define _QSPI_DEVINSTRRDCONFIG_DDREN_MASK                         0x400UL                                                    /**< Bit mask for QSPI_DDREN */
#define _QSPI_DEVINSTRRDCONFIG_DDREN_DEFAULT                      0x00000000UL                                               /**< Mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_DDREN_DEFAULT                       (_QSPI_DEVINSTRRDCONFIG_DDREN_DEFAULT << 10)               /**< Shifted mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define _QSPI_DEVINSTRRDCONFIG_ADDRXFERTYPESTDMODE_SHIFT          12                                                         /**< Shift value for QSPI_ADDRXFERTYPESTDMODE */
#define _QSPI_DEVINSTRRDCONFIG_ADDRXFERTYPESTDMODE_MASK           0x3000UL                                                   /**< Bit mask for QSPI_ADDRXFERTYPESTDMODE */
#define _QSPI_DEVINSTRRDCONFIG_ADDRXFERTYPESTDMODE_DEFAULT        0x00000000UL                                               /**< Mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_ADDRXFERTYPESTDMODE_DEFAULT         (_QSPI_DEVINSTRRDCONFIG_ADDRXFERTYPESTDMODE_DEFAULT << 12) /**< Shifted mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define _QSPI_DEVINSTRRDCONFIG_DATAXFERTYPEEXTMODE_SHIFT          16                                                         /**< Shift value for QSPI_DATAXFERTYPEEXTMODE */
#define _QSPI_DEVINSTRRDCONFIG_DATAXFERTYPEEXTMODE_MASK           0x30000UL                                                  /**< Bit mask for QSPI_DATAXFERTYPEEXTMODE */
#define _QSPI_DEVINSTRRDCONFIG_DATAXFERTYPEEXTMODE_DEFAULT        0x00000000UL                                               /**< Mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_DATAXFERTYPEEXTMODE_DEFAULT         (_QSPI_DEVINSTRRDCONFIG_DATAXFERTYPEEXTMODE_DEFAULT << 16) /**< Shifted mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_MODEBITENABLE                       (0x1UL << 20)                                              /**< Mode Bit Enable */
#define _QSPI_DEVINSTRRDCONFIG_MODEBITENABLE_SHIFT                20                                                         /**< Shift value for QSPI_MODEBITENABLE */
#define _QSPI_DEVINSTRRDCONFIG_MODEBITENABLE_MASK                 0x100000UL                                                 /**< Bit mask for QSPI_MODEBITENABLE */
#define _QSPI_DEVINSTRRDCONFIG_MODEBITENABLE_DEFAULT              0x00000000UL                                               /**< Mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_MODEBITENABLE_DEFAULT               (_QSPI_DEVINSTRRDCONFIG_MODEBITENABLE_DEFAULT << 20)       /**< Shifted mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define _QSPI_DEVINSTRRDCONFIG_DUMMYRDCLKCYCLES_SHIFT             24                                                         /**< Shift value for QSPI_DUMMYRDCLKCYCLES */
#define _QSPI_DEVINSTRRDCONFIG_DUMMYRDCLKCYCLES_MASK              0x1F000000UL                                               /**< Bit mask for QSPI_DUMMYRDCLKCYCLES */
#define _QSPI_DEVINSTRRDCONFIG_DUMMYRDCLKCYCLES_DEFAULT           0x00000000UL                                               /**< Mode DEFAULT for QSPI_DEVINSTRRDCONFIG */
#define QSPI_DEVINSTRRDCONFIG_DUMMYRDCLKCYCLES_DEFAULT            (_QSPI_DEVINSTRRDCONFIG_DUMMYRDCLKCYCLES_DEFAULT << 24)    /**< Shifted mode DEFAULT for QSPI_DEVINSTRRDCONFIG */

